'''
# Problem 1:Что больше или равно числа 17925:(34**2) (26*3) (17*33) (4394*4)
a =(17925)
b = (34**2) 
c = (26*3) 
d =  (17*33) 
e =  (4394*4)
print (b>=a ,c>=a,d>=a ,e>=a)
'''
'''
# Problem 2:Создайте 4 условия:
#1.Число А больше В но меньше С.
a = (12)
b = (10)
c = (14)
print (a,b,c)
#2. Результат деления по модулю числа 7 на 3 умножить на 4.8
a = ((7%3)*4.8)
print (a)
#3. Создать два разных выражения которые равны друг другу.
a = (5)
b = (5)
print (a==b)
#4. Создать 2 выражения которые  НЕ равны друг другу.
a = (27)
b = (17)
print (a!=b)
'''
'''
#Problem 3:Составить выражение:
#Сложить 2 любых числа#Умножить их на любое число#Возвести в квадрат#Отнять от всего результат: 193432
a = (55)
b = (67)
c = (193432)
d = ((a+b)*6)
e = (d**2)
print (e-c)
'''
'''
#Problem 4:Что больше:
#(17*3)  (12*5)
#(12**3) (13*7)
#(4**5) 
#(512+512)
a = (17*3)>(12*5)
b =(12**3)<(13*7)
c = (4**5)
d = (512+512)
g =(a>b)<(c==d),
print ( "Больше всех", (c,d) )
'''
'''
#PROBLEM 5:Чему равен пример -21//10
#Почему именно этот ответ?
a =(-21//10)
print ('Пример равен:',a,"Потому что мы поделили отрицательное число с округлением в меньшую сторону", )
'''
'''
#PROBLEM 6:Найдите, какой процент этого столетия мы прожили:
# формула расчета процентов (a/b)*100 где a-прожитые года b-сколько нужно(тк. это столетие, b-100)
a = (21)
b =(100) 
c = ((a/b)*100)
print (c)
'''
'''
#PROBLEM 7:cоздать 2 переменные.В первой год вашего рождения, Во второй 2020 год 
#посчитайте сколько лет вам должно быть через 2 года/и сколько лет вам было два года назад
a = (2000)
b = (2020)
v = ((b-a)+2)
c = ((b-a)-2)
print ('Через два годма мне:',v,'.Два года назад мне было',c,)
'''
'''
#PROBLEM 8:Найдите средне арифмитическое чисел:25, 75, 10, 95. 
a = ((25+75+10+95)/4)
print ('Среднее арифмитическое чисел получается:',a)
'''
'''
#Problem 9:Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой. Первые 2 переменные между собой сложить и умножить на 3 переменную
a = (2.5)
b = (2.5)
c = (2.5)
d = ((a+b)*c)
print (d)
'''
'''
# Problem 10:
#Создать 5 переменных:
#.Чётное число
#.Любое от 5 до 15
#c.Дробное число до 20
#d.Любое нечётное число
#e.Любое число
a = (4)
b = (14)
c = (16.3)
d = (3)
e = (1234)
'''
'''
#Problem 11:Из Задания 3:Составить выражение:(a-e**(b/d))%c
a = (55)
b = (67)
c = (193432)
d = ((a+b)*6)
e = (d**2)
g = (a-e**(b/d))%c
print (g)
'''
