#Создать кортеж и 5 вложенных кортежей с разными типыми данных.
a=(1,'word',2.4,True,[5,6.90,],{6:8})


#2Создать Tuple из 3 элементов и вывести каждый из них по индексу.
'''
a = ('world','war','love')
print(a.index('world'),a.index('war'),a.index('love'))
'''
#3Вывести 'x1' из 
#Кортеж 1
'''
kortej1  = (1, 2, ('q', ('w', 'e',), 0,), 3, (4, ('r', (7, ('x1',), 'y',), 't', 8,), 5, 6,))
print(kortej1[4][-3][-3][-2][0])
'''
